0. 所有的题目结果中，给出SQL语句和执行结果。

1. 在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)，数据如下：

    ('John Doe', 'Male', 25, '123-456-7890')

    ('Jane Smith', 'Female', 31, '987-654-3210')
    
    ('Bob Johnson', 'Male', 22, '555-123-4567')

#### 代码：
CREATE TABLE `user` (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    sex VARCHAR(10),
    age INT,
    phone VARCHAR(15)
);
INSERT INTO `user` (name, sex, age, phone) VALUES
('John Doe', 'Male', 25, '123-456-7890'),
('Jane Smith', 'Female', 31, '987-654-3210'),
('Bob Johnson', 'Male', 22, '555-123-4567');
SELECT * FROM `user`;

#### 运行结果：
1	John Doe	Male	25	123-456-7890
2	Jane Smith	Female	31	987-654-3210
3	Bob Johnson	Male	22	555-123-4567
（在MySql中为grid视图）

2. 写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户

#### 代码：
SELECT * FROM `user`
WHERE age BETWEEN 20 AND 30;

#### 运行结果：
1	John Doe	Male	25	123-456-7890
3	Bob Johnson	Male	22	555-123-4567

3. 写出SQL语句，向user表中添加自己的个人信息，并添加几条和你姓名同姓的虚拟信息。

#### 代码：
INSERT INTO `user` (name, sex, age, phone) VALUES
('Yu Ke', 'Male', 20, '13792762265');

INSERT INTO `user` (name, sex, age, phone) VALUES
('Yi Ke', 'Male', 28, '18629206638'),
('Yuan Ke', 'Female', 26, '15359896080'),
('Yue Ke', 'Male', 30, '13997708812'),
('Yua Ke', 'Female', 10, '19132161902');

SELECT * FROM `user`;

#### 运行结果：
1	John Doe	Male	25	123-456-7890
2	Jane Smith	Female	31	987-654-3210
3	Bob Johnson	Male	22	555-123-4567
4	Yu Ke	Male	20	13792762265
5	Yi Ke	Male	28	18629206638
6	Yuan Ke	Female	26	15359896080
7	Yue Ke	Male	30	13997708812
8	Yua Ke	Female	10	19132161902

4. 写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“你的姓氏”的用户,并按照年龄从大到小排序输出

#### 代码：
SELECT *
FROM `user`
WHERE age BETWEEN 20 AND 30
  AND name LIKE '%Ke%'
ORDER BY age DESC;
#### 运行结果：
7	Yue Ke	Male	30	13997708812
5	Yi Ke	Male	28	18629206638
6	Yuan Ke	Female	26	15359896080
4	Yu Ke	Male	20	13792762265

5. 写出 SQL 语句,计算 user 表中所有用户的平均年龄

#### 代码：
SELECT AVG(age) AS average_age FROM `user`;
#### 运行结果：
24.0000

6. 新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键

#### 代码：
CREATE TABLE `team` (
    id INT AUTO_INCREMENT PRIMARY KEY,
    teamName VARCHAR(100) NOT NULL
);

CREATE TABLE `score` (
    id INT AUTO_INCREMENT PRIMARY KEY,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES `team`(id) ON DELETE CASCADE,
    FOREIGN KEY (userid) REFERENCES `user`(id) ON DELETE CASCADE
);

#### 执行结果：
表已存在，但无数据。

7. 在team表中和score表中插入合适的记录，写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们，结果不得为空。

#### 代码：
INSERT INTO `team` (teamName) VALUES ('ECNU'), ('Team B'), ('Team C');

INSERT INTO `score` (teamid, userid, score) VALUES 
(1, 1, 95),  
(1, 3, 90),  
(2, 2, 85),  
(2, 4, 88),  
(1, 5, 92),  
(1, 6, 80),  
(2, 7, 87),  
(1, 8, 95);  

SELECT u.*
FROM `user` u
JOIN `score` s ON u.id = s.userid
JOIN `team` t ON s.teamid = t.id
WHERE t.teamName = 'ECNU' AND u.age < 20;

#### 运行结果：
8	Yua Ke	Female	10	19132161902

8. 写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

#### 代码：
SELECT SUM(COALESCE(s.score, 0)) AS total_score
FROM `score` s
JOIN `team` t ON s.teamid = t.id
WHERE t.teamName = 'ECNU';

#### 运行结果：
452

9. 写出SQL语句，删除user表中个人信息的记录。

#### 代码：
SET SQL_SAFE_UPDATES = 0; --解除安全模式

DELETE FROM `user`;

SET SQL_SAFE_UPDATES = 1; --重设安全模式

#### 运行结果：
空表格